# Factorizer

Experimenting with Elixir Concurrency using Prime Numbers.

## Example

Start `iex` with the current mix project:

    $ iex -S mix

Factorize some numbers:

    > Stopwatch.timed(fn -> Factorizer.factorize(1_000_000_000..1_000_000_010) end)
    4.201577s
    %{
      1000000000 => [2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 5, 5, 5, 5, 5, 5, 5],
      1000000001 => [7, 11, 13, 19, 52579],
      1000000002 => [2, 3, 43, 983, 3943],
      1000000003 => [23, 307, 141623],
      1000000004 => [2, 2, 41, 41, 148721],
      1000000005 => [3, 5, 66666667],
      1000000006 => [2, 500000003],
      1000000007 => [1000000007],
      1000000008 => [2, 2, 2, 3, 3, 7, 109, 109, 167],
      1000000009 => [1000000009],
      1000000010 => [2, 5, 17, 5882353]
    }

Factorize the same numbers _in parallel_ (~ 2.5 seconds):

    > Stopwatch.timed(fn -> ParallelFactorizer.factorize(1_000_000_000..1_000_000_010) end)
    1.099281s
    %{
      1000000000 => [2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 5, 5, 5, 5, 5, 5, 5],
      1000000001 => [7, 11, 13, 19, 52579],
      1000000002 => [2, 3, 43, 983, 3943],
      1000000003 => [23, 307, 141623],
      1000000004 => [2, 2, 41, 41, 148721],
      1000000005 => [3, 5, 66666667],
      1000000006 => [2, 500000003],
      1000000007 => [1000000007],
      1000000008 => [2, 2, 2, 3, 3, 7, 109, 109, 167],
      1000000009 => [1000000009],
      1000000010 => [2, 5, 17, 5882353]
    }

Same again, but with one server process per scheduler (Round Robin):

    > Stopwatch.timed(fn -> FactorizerClient.factorize(1_000_000_000..1_000_000_010) end)
    1.207592s
    %{
      1000000000 => [2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 5, 5, 5, 5, 5, 5, 5],
      1000000001 => [7, 11, 13, 19, 52579],
      1000000002 => [2, 3, 43, 983, 3943],
      1000000003 => [23, 307, 141623],
      1000000004 => [2, 2, 41, 41, 148721],
      1000000005 => [3, 5, 66666667],
      1000000006 => [2, 500000003],
      1000000007 => [1000000007],
      1000000008 => [2, 2, 2, 3, 3, 7, 109, 109, 167],
      1000000009 => [1000000009],
      1000000010 => [2, 5, 17, 5882353]
    }

Same again, but implemented using a server process with a callback module:

    > Stopwatch.timed(fn -> FactorizerClient.factorize(1_000_000_000..1_000_000_010) end)
    1.158415s
    %{
      1000000000 => [2, 2, 2, 2, 2, 2, 2, 2, 2, 5, 5, 5, 5, 5, 5, 5, 5, 5],
      1000000001 => [7, 11, 13, 19, 52579],
      1000000002 => [2, 3, 43, 983, 3943],
      1000000003 => [23, 307, 141623],
      1000000004 => [2, 2, 41, 41, 148721],
      1000000005 => [3, 5, 66666667],
      1000000006 => [2, 500000003],
      1000000007 => [1000000007],
      1000000008 => [2, 2, 2, 3, 3, 7, 109, 109, 167],
      1000000009 => [1000000009],
      1000000010 => [2, 5, 17, 5882353]
    }
